String bURLTelegram = "https://web.telegram.org/k/#@Shahabfitbot";
String sURLTelegram = "https://web.telegram.org/k/#@Shahabfit";
String sURLInstagram = "https://www.instagram.com/shahabfit1";

var blogText = '''
محاسبه کالری مورد نیاز
در این مقاله یاد می‌گیریم که چطور کالری مورد نیازمان را محاسبه کنیم.
کالری روزانه ما شامل چه مواردی می‌شود؟
انرژی روزانه ما صرف ۴ مورد می‌شود:

سوخت و ساز پایه (BMR):
این بخش زیادی از انرژی مصرفی ما در طول روز را تشکیل می‌دهد. سوخت و ساز پایه حداقل انرژی است که بدن ما برای بقاء به آن نیاز دارد.

NEAT و NEPA:
به بیان ساده شامل فعالیت‌هایی غیر از فعالیت ورزشی می‌شود. NEPA مثل وول خوردن، تایپ کردن، تکان دادن پا و ... است و NEAT شامل فعالیت‌هایی است که شکل ورزش نداشته باشد، مثلا پیاده رفتن تا آشپزخانه یا ایستادن.

انرژی مصرفی در طول فعالیت ورزشی:
این مورد نیازی به توضیح دادن ندارد و واضح است!

اثر حرارتی غذا (TEF):
به بیان ساده مقدار انرژی است که صرف می‌شود تا کالری مواد غذایی در دسترس بدن قرار گیرد (مثلا برای هضم و جذب انرژی مصرف می‌شود).

پس:
کل کالری مصرفی روزانه = سوخت و ساز پایه + انرژی فعالیت‌های غیر ورزشی + انرژی فعالیت ورزشی + اثر حرارتی غذا

برای محاسبه کالری مورد نیاز باید همه این موارد منظور شود؟
بله، اما شما می‌توانید با محاسبه سوخت و ساز پایه (BMR) و استفاده از ضریب فعالیت (در همین مقاله بررسی می‌کنیم) به تخمین نسبتا مناسبی از کالری مورد نیاز خود برسید.

فرمول‌های محاسبه BMR
برای محاسبه BMR یا همان سوخت و ساز پایه، فرمول‌های مختلفی وجود دارد. مثل فرمول هریس – بندیکت و فرمول مولر که از مشهورترین روش‌های محاسبه BMR هستند.

ما در این مقاله به سراغ معادله اصلاح شده هریس – بندیکت می‌رویم زیرا محاسبه آن پیچیده نیست و نیازی به محاسبه درصد چربی بدن و ... ندارد و همچنین دقت نسبتا خوبی دارد.

معادله اصلاح شده هریس-بندکیت برای آقایان و خانم‌ها متفاوت است که هر دو را بررسی می‌کنیم.

معادله هریس بندیکت برای آقایان
سوخت و ساز پایه = (سن × ۵.۶۷۷) - (قد × ۴.۷۹۹) + (وزن بدن × ۱۳.۳۹۷) + ۸۸.۳۶۲

معادله هریس بندیکت برای خانم‌ها
سوخت و ساز پایه = (سن × ۴.۳۳) - (قد × ۳.۰۹۸) + (وزن بدن × ۹.۲۴۷) + ۴۴۷.۵۹۳

تا اینجا ما سوخت و ساز پایه را محاسبه کردیم. حالا برای تخمین کالری مورد نیاز باید عدد به دست آمده از محاسبات بالا را در ضریب فعالیت ضرب کنیم.

ضریب فعالیت
ضریب فعالیت یا عامل میزان فعالیت عددی است که بسته به میزان فعالیت روزانه باید در سوخت و ساز پایه ضرب کنیم تا به کالری مصرفی روزانه برسیم. عامل میزان فعالیت عددی بین ۱.۲ تا ۱.۹ است که کمترین آن یعنی ۱.۲ یعنی کمترین میزان فعالیت و ۱.۹ یعنی بیشترین میزان فعالیت که در زیر دقیق‌تر بررسی می‌کنیم.

ضریب فعالیت ۱.۲:
فرد بی تحرک است و فعالیت ورزشی هم انجام نمی‌دهد.

ضریب فعالیت ۱.۴:
مناسب افرادی است که شغلشان کم تحرک است اما فعالیت ورزشی منظم دارند و یا افرادی که فعالیت ورزشی ندارند اما به واسطه شغلشان اغلب مواقع سرپا هستند مثل پرستاران.

ضریب فعالیت ۱.۵۵:
این ضریب برای افرادی است که شغل چندان فعالی ندارند اما در تمرین سنگ تمام می‌گذارند و فعالیت ورزشی پر شدتی دارند و معمولا چند جلسه در هفته تمرین با شدت مناسب دارند و یا افرادی که فعالیت ورزشی پر شدتی ندارند و عادی تمرین می‌کنند اما شغلشان پر جنب و جوش است.

ضریب فعالیت ۱.۷:
این ضریب برای افرادی مناسب است که اغلب روزهای هفته سخت تمرین می‌کنند و در کنار آن شغلشان به گونه‌ای است که اغلب مواقع ایستاده هستند و در طول روز فعالیت بالایی دارند.

ضریب فعالیت ۱.۹:
این ضریب برای ورزشکارانی است که بسیار سخت تمرین می‌کنند و همچنین شغلشان هم از نظر فعالیت فیزیکی سخت است مثل کارگر یا بنا که در طول روز به واسطه شغلی که دارد فعال است و علاوه بر آن سخت هم تمرین می‌کند.

جمع بندی
با استفاده از اعداد فرمول ارائه شده در بالا و ضریب فعالیت می‌توانید به راحتی تخمینی نسبتا دقیق از کالری مصرفی خود در طول روز داشته باشید. پس از محاسبه موارد بالا و به دست آوردن کالری مورد نیاز خود، می‌توانید بسته به هدفی که دارید کالری دریافتی از مواد غذایی را محاسبه و در رژیم غذایی خود لحاظ کنید.
''';
var blog2 =
    '''تمرین هوازی، یا کاردیو، فواید بسیاری برای سلامت جسمی و روانی دارد. این نوع تمرینات به بهبود سلامت قلب و عروق، افزایش ظرفیت ریه‌ها، تقویت سیستم ایمنی، کاهش استرس و بهبود حالت روحی کمک می‌کنند.
علاوه بر این، تمرینات هوازی به کاهش وزن و حفظ وزن ایده‌آل نیز کمک می‌کنند.

بهترین زمان برای تمرین هوازی 
تمرینات صبحگاهی
تمرینات هوازی صبحگاهی می‌توانند مزایای زیادی داشته باشند، به ویژه برای کاهش وزن. انجام تمرینات صبحگاهی با معده خالی می‌تواند به سوزاندن چربی‌های ذخیره‌شده در بدن کمک کند. با این حال، اگر در این حالت ورزش کنید، ممکن است بدن شما عضلات را نیز تجزیه کند تا انرژی لازم را تامین کند. به همین دلیل، توصیه می‌شود قبل از تمرین صبحگاهی یک وعده غذایی سبک مصرف کنید تا از تحلیل عضلات جلوگیری شود.

تمرینات عصرگاهی 
اگر شما ترجیح می‌دهید تمرینات هوازی را عصر انجام دهید، این نیز می‌تواند مفید باشد. در این زمان، دمای بدن و انعطاف‌پذیری عضلات به اوج خود می‌رسد و این می‌تواند به بهبود عملکرد ورزشی شما کمک کند. تمرینات عصرگاهی می‌توانند به کاهش استرس و بهبود خواب کمک کنند، اما باید دقت کنید که حداقل یک ساعت قبل از خواب تمرینات خود را به پایان برسانید تا از اختلال در خواب جلوگیری شود.

فواید تمرین هوازی 
۱- سلامت قلب و عروق: تمرینات هوازی باعث تقویت قلب و بهبود عملکرد سیستم گردش خون می‌شوند.
۲- کاهش وزن: این نوع تمرینات به سوزاندن کالری و کاهش چربی بدن کمک می‌کنند.
۳-بهبود حالت روحی: تمرینات هوازی باعث ترشح اندورفین‌ها می‌شوند که به کاهش استرس و بهبود حالت روحی کمک می‌کنند.
۴-افزایش انرژی: انجام منظم تمرینات هوازی می‌تواند سطح انرژی شما را افزایش دهد و خستگی را کاهش دهد.
۵-تقویت سیستم ایمنی: تمرینات هوازی منظم به تقویت سیستم ایمنی بدن کمک می‌کنند و خطر ابتلا به بیماری‌های مزمن را کاهش می‌دهند.

نکات مهم
انتخاب زمان مناسب: بهترین زمان برای تمرین هوازی زمانی است که شما بیشترین انرژی و انگیزه را دارید. این زمان می‌تواند بسته به برنامه روزانه و عادات شما متفاوت باشد.
تغذیه مناسب: مصرف یک وعده غذایی سبک قبل از تمرین می‌تواند به حفظ انرژی و جلوگیری از تحلیل عضلات کمک کند.
استمرار: مهم‌ترین نکته در تمرینات هوازی، استمرار و رعایت برنامه منظم است. بهتر است تمرینات خود را به صورت منظم و با برنامه‌ریزی دقیق انجام دهید تا به نتایج مطلوب برسید.''';
var blog3 =
    '''رسیدن به یک بدن عضلانی و فیتنس نیازمند ترکیبی از تمرین منظم، تغذیه مناسب و رعایت سبک زندگی سالم است. در ادامه به بررسی این عوامل می‌پردازیم:

۱- تمرینات بدنسازی
برنامه تمرینی یک برنامه تمرینی مؤثر برای عضله‌سازی باید شامل تمرینات قدرتی با تمرکز بر روی تمامی گروه‌های عضلانی اصلی باشد. به‌طور کلی، بهتر است هر گروه عضلانی را حداقل دو بار در هفته تمرین دهید. برخی از تمرینات کلیدی شامل:
تمرینات چند مفصلی: مانند اسکات، ددلیفت، پرس سینه و بارفیکس که گروه‌های عضلانی بزرگ را درگیر می‌کنند.
تمرینات تک مفصلی: مانند جلوبازو دمبل، پشت بازو و ساق پا که برای تمرکز بر روی عضلات کوچکتر مفید هستند.

تعداد ست و تکرار
برای افزایش حجم عضلات، معمولاً توصیه می‌شود:
تعداد ست‌ها: 3 تا 5 ست برای هر تمرین تعداد تکرارها: 8 تا 12 تکرار در هر ستاستراحت بین ست‌ها: 60 تا 90 ثانیه 

۲- تغذیه مناسب
مصرف پروتئین
پروتئین نقش حیاتی در رشد و ترمیم عضلات دارد. منابع خوب پروتئین شامل گوشت‌های بدون چربی، مرغ، ماهی، تخم‌مرغ، لبنیات و منابع گیاهی مانند لوبیا و توفو است. معمولاً توصیه می‌شود که افراد فعال 1.6 تا 2.2 گرم پروتئین به ازای هر کیلوگرم وزن بدن در روز مصرف کنند.
مصرف کربوهیدرات و چربی 
کربوهیدرات‌ها منبع اصلی انرژی برای تمرینات بدنسازی هستند. منابع خوب کربوهیدرات شامل غلات کامل، میوه‌ها و سبزیجات است. چربی‌ها نیز برای تولید هورمون‌های ضروری و حفظ سلامت عمومی بدن مهم هستند. منابع چربی سالم شامل آجیل‌ها، دانه‌ها، آووکادو و روغن‌های گیاهی است.

۳- استراحت و ریکاوری 
استراحت کافی به بدن شما این امکان را می‌دهد تا عضلات را ترمیم و تقویت کند. به طور کلی، خواب کافی (7-9 ساعت در شب) و استراحت بین تمرینات برای ریکاوری بسیار مهم است.

۴- سبک زندگی سالم
علاوه بر تمرین و تغذیه، رعایت سبک زندگی سالم نیز مهم است:
مدیریت استرس: استرس می‌تواند تأثیر منفی بر روی بدن داشته باشد و فرآیند عضله‌سازی را مختل کند. استفاده از تکنیک‌های مدیریت استرس مانند مدیتیشن و یوگا مفید است.
هیدراتاسیون: مصرف کافی آب برای حفظ عملکرد عضلات و جلوگیری از کم‌آبی بسیار مهم است.

جمع‌بندی
برای رسیدن به بدن عضلانی و فیتنس، باید یک برنامه تمرینی منظم و جامع داشته باشید، تغذیه مناسب و متعادل را رعایت کنید، به استراحت و ریکاوری توجه کنید و سبک زندگی سالمی را در پیش بگیرید. استمرار و تعهد به این اصول، کلید دستیابی به نتایج مطلوب است.''';
